
public enum 学位給 {

	大専1等Ⅰ(0),
	大専2等Ⅰ(1),
	大専3等Ⅰ(2),
	大専4等Ⅰ(3),
	学士1等Ⅰ(4),
	学士2等Ⅰ(5),
	学士3等Ⅰ(6),
	学士4等Ⅰ(7),
	修士1等Ⅰ(8),
	修士2等Ⅰ(9),
	修士3等Ⅰ(10),
	修士4等Ⅰ(11),
	大専1等Ⅱ(12),
	大専2等Ⅱ(13),
	大専3等Ⅱ(14),
	大専4等Ⅱ(15),
	学士1等Ⅱ(16),
	学士2等Ⅱ(17),
	学士3等Ⅱ(18),
	学士4等Ⅱ(19),
	修士1等Ⅱ(20),
	修士2等Ⅱ(21),
	修士3等Ⅱ(22),
	修士4等Ⅱ(23),
	大専1等Ⅲ(24),
	大専2等Ⅲ(25),
	大専3等Ⅲ(26),
	大専4等Ⅲ(27),
	学士1等Ⅲ(28),
	学士2等Ⅲ(29),
	学士3等Ⅲ(30),
	学士4等Ⅲ(31),
	修士1等Ⅲ(32),
	修士2等Ⅲ(33),
	修士3等Ⅲ(34),
	修士4等Ⅲ(35),
	大専1等Ⅳ(36),
	大専2等Ⅳ(37),
	大専3等Ⅳ(38),
	大専4等Ⅳ(39),
	学士1等Ⅳ(40),
	学士2等Ⅳ(41),
	学士3等Ⅳ(42),
	学士4等Ⅳ(43),
	修士1等Ⅳ(44),
	修士2等Ⅳ(45),
	修士3等Ⅳ(46),
	修士4等Ⅳ(47),
	;

	private Integer code;
	private 学位給(final Integer code) {
		this.code = code;
	}

}
